*** By price

#+BEGIN_SRC elisp
  (org-fitness-list-food-by "price")
#+END_SRC

#+RESULTS:
| Food                                                               | Calories | Protein | Price | Comment                                                                                                                                        |
| Kroger: spreadable butter w/canola oil (0.5 tbsp)                  |       50 |       0 |  0.00 |                                                                                                                                                |
| Thomas: 100% Whole Wheat Bagel Thins (1 bagel thin)                |      110 |       6 |  0.00 | Free from Ms. Dodie (someone gave them to her)                                                                                                 |
| Smucker's: Blackberry Jam (1 tbsp)                                 |       50 |       0 |  0.00 | Check price                                                                                                                                    |
| blueberries (1/4 cup)                                              |    21.25 |    0.28 |  0.00 | Check price                                                                                                                                    |
| Oroweat: sesame-seeded sandwich roll                               |      150 |       5 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| homemade: hamburger patty (100g, guessing)                         |      204 |      15 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| Glutenfreeda: Banana Maple with Flax instant oatmeal               |      180 |       6 |  0.00 | Check price                                                                                                                                    |
| Hardee's: Hash Rounds (small)                                      |      260 |       2 |  0.00 | Price included in combo                                                                                                                        |
| Hardee's: Dr. Pepper (small)                                       |      150 |       0 |  0.00 | Price included in combo                                                                                                                        |
| Taco Bell: Extra-Large Sangrita Blast Mt. Dew                      |      410 |       0 |  0.00 | Price included in combo.  Not sure about size, doesn't seem to match web site.                                                                 |
| Taco Bell: Cruncy Taco (beef, cheese, lettuce)                     |      170 |       8 |  0.00 | Price included in combo                                                                                                                        |
| Hardee's: Cherry Coke (medium)                                     |      260 |       0 |  0.00 |                                                                                                                                                |
| Hardee's: Country Ham Biscuit                                      |      370 |      15 |  0.00 |                                                                                                                                                |
| Wendy's: Fries (small)                                             |      320 |       5 |  0.00 | Price included in Baconator meal                                                                                                               |
| Wendy's: Coca-Cola (small)                                         |      200 |       0 |  0.00 | Price included in Baconator meal                                                                                                               |
| Chick-Fil-A: Seasoned Tortilla Strips                              |       70 |       1 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Smokehouse Barbecue Sauce (1 packet)                  |       35 |       0 |  0.00 |                                                                                                                                                |
| Kroger: honey (1/2 tbsp)                                           |       30 |       0 |  0.00 |                                                                                                                                                |
| Zaxby's: Texas Toast (1 piece)                                     |      150 |       3 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Zaxby's: Dr. Pepper (small, 22 oz)                                 |      150 |       0 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Zaxby's: Crinkle Fries (5 oz)                                      |      440 |       5 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Zaxby's: Honey Mustard (1 portion cup)                             |      330 |       1 |  0.00 |                                                                                                                                                |
| Kroger: apricot preserves (1 tbsp)                                 |       40 |       0 |  0.00 |                                                                                                                                                |
| Quaker: Instant Oatmeal, apple cinnamon (1 packet)                 |      160 |       4 |  0.00 | check price                                                                                                                                    |
| KFC: Dr. Pepper (large, 30 oz)                                     |      380 |       0 |  0.00 | Included in "Fill-Up Box"                                                                                                                      |
| KFC: biscuit                                                       |      180 |       4 |  0.00 |                                                                                                                                                |
| KFC: Potato Wedges (individual size)                               |      270 |       4 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken, Egg, and Cheese Biscuit                |      560 |      28 |       | Free with survey coupon                                                                                                                        |
| Chick-Fil-A: Spicy Chicken Biscuit                                 |      440 |      16 |       | Free one from last time, but they also left off the egg and cheese this time.                                                                  |
| Hardee's: Natural-Cut French Fries (small)                         |      360 |       4 |       |                                                                                                                                                |
| Ocean Spray: Craisins, blueberry-infused (1/8 cup)                 |       65 |       0 |       |                                                                                                                                                |
| Chick-Fil-A: Harvest Nut Granola (1 packet)                        |       60 |       1 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Roasted Nut Blend (1 packet)                          |       70 |       1 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Zesty Apple Cider Vinaigrette Dressing (1 packet)     |      200 |       0 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Classic Chicken Sandwich                              |      440 |      28 |       | Free sandwich again!                                                                                                                           |
| Kroger: creamy peanut butter (1 tbsp/16 g)                         |       90 |     3.5 |  0.06 |                                                                                                                                                |
| Kroger: creamy peanut butter (2 tbsp/32 g)                         |      180 |       7 |  0.12 |                                                                                                                                                |
| Pepperidge Farm: Swirl cinnamon raisin bread (1 slice)             |       80 |       3 |  0.19 |                                                                                                                                                |
| Maruchan: Ramen noodles, beef (1 package with flavor packet)       |      380 |      10 |  0.21 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (1 tbsp)            |       35 |     2.5 |  0.22 |                                                                                                                                                |
| Banana (medium)                                                    |      105 |       1 |  0.22 |                                                                                                                                                |
| Kroger: swiss cheese (1 slice)                                     |       80 |       6 |  0.31 |                                                                                                                                                |
| Kroger: cheddar cheese (1 slice)                                   |       80 |       5 |  0.31 |                                                                                                                                                |
| Nature's Own: honey wheat bread (2 slices)                         |      140 |       6 |  0.32 |                                                                                                                                                |
| Kroger: bagel, cinnamon raisin (1 bagel)                           |      260 |       8 |  0.33 |                                                                                                                                                |
| Quaker: Steel Cut oatmeal w/blueberries, cranberries (1 packet)    |      170 |       4 |  0.34 | Price from Google search, Walmart listing                                                                                                      |
| Sara Lee: Sweet Hawaiian Sandwich Roll (1 bun)                     |      170 |       5 |  0.34 |                                                                                                                                                |
| McCormick: Grill Mates, Montreal Steak smoked sausage (1 link)                      |      180 |       9 |  0.37 |                                                                                                                                                |
| Nature's Own: whole wheat hot dog bun                              |      110 |       5 |  0.40 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (2 tbsp)            |       70 |       5 |  0.43 |                                                                                                                                                |
| Quaker: Protein Oatmeal, Cranberry Almond (1 packet)               |      240 |      10 |  0.50 |                                                                                                                                                |
| Wendy's: Dr. Pepper (large)                                        |      240 |       0 |  0.55 | $0.55 on top of Baconator combo                                                                                                                |
| Kellogg's: Special K Nourish Apple Raspberry Almond cereal (1 cup) |      190 |       5 |  0.64 |                                                                                                                                                |
| Kroger: turkey breast, honey smoked, deli thin sliced (2 oz)       |       60 |       9 |  0.66 |                                                                                                                                                |
| Kroger: turkey breast, mesquite smoked, deli thin sliced           |       60 |       9 |  0.66 |                                                                                                                                                |
| Thomas: blueberry bagel                                            |      270 |       9 |  0.67 |                                                                                                                                                |
| Met-Rx: 100% Natural Whey Chocolate (1 scoop)                      |      130 |      23 |  0.78 |                                                                                                                                                |
| Zaxby's: Brownie                                                   |      360 |       4 |  0.99 |                                                                                                                                                |
| Taco Bell: Dr. Pepper (large)                                      |      380 |       0 |  1.00 |                                                                                                                                                |
| Arby's: Triple Chocolate Cookie                                    |      450 |       5 |   1.0 |                                                                                                                                                |
| Arby's: Salted Caramel & Chocolate Cookie                          |      430 |       4 |   1.0 |                                                                                                                                                |
| Chick-Fil-A: Hash Rounds (1 box)                                   |      240 |       2 |  1.00 |                                                                                                                                                |
| Chick-Fil-A: Dr. Pepper (large)                                    |      260 |         |  1.00 |                                                                                                                                                |
| Chick-Fil-A: Chocolate Chip Cookie                                 |      350 |       4 |  1.19 |                                                                                                                                                |
| Taco Bell: Chips and Salsa                                         |      250 |       4 |  1.29 |                                                                                                                                                |
| Arby's: Mozzarella Sticks (3 piece)                                |      345 |      15 |  1.38 | He gave me a 7-piece by mistake, so I ate 4 and now the rest.                                                                                  |
| Taco Bell: Beefy Fritos Burrito (-nacho cheese, w/3 cheese blend)  |      450 |      16 |  1.39 |                                                                                                                                                |
| Chick-Fil-A: Peppermint Chocolate Chip milkshake (1/2 of small)    |      295 |       6 |  1.43 |                                                                                                                                                |
| Arby's: Dr. Pepper (medium)                                        |      252 |       0 |  1.50 |                                                                                                                                                |
| Chick-Fil-A: Dr. Pepper (medium)                                   |      180 |       0 |  1.59 |                                                                                                                                                |
| KFC: Chicken Little, Nashville Hot                                 |      320 |      13 |  1.59 | Don't know if Nashville Hot makes a difference                                                                                                 |
| Kroger: deli fried chicken tender (1 piece, ~125g)                 |      308 |    37.5 |  1.66 |                                                                                                                                                |
| Chick-Fil-A: Waffle Potato Fries (medium)                          |      400 |       5 |  1.69 |                                                                                                                                                |
| Campbell's Chunky: Chicken Corn Chowder (1 can, 240ml)             |      380 |      10 |  1.79 |                                                                                                                                                |
| Campbell's Chunky: Chipotle Chicken & Corn Chowder (1 can, 240ml)  |      360 |      14 |  1.79 |                                                                                                                                                |
| Campbell's Chunky: Savory Pot Roast                                |      240 |      12 |  1.79 |                                                                                                                                                |
| Campbell's Chunky Soup: Spicy BBQ Seasoned Chicken w/Beans (1 can) |      420 |      22 |  1.79 |                                                                                                                                                |
| Campbell's Chunky: Chili, Hot & Spicy with Bean Firehouse (1 can)  |      480 |      28 |  1.79 |                                                                                                                                                |
| Campbell's Chunky: Chili Mac (1 can)                               |      400 |      18 |  1.79 |                                                                                                                                                |
| Arby's: Dr. Pepper (large)                                         |      324 |       0 |  1.80 |                                                                                                                                                |
| Arby's: Mozzarella Sticks (4 piece)                                |      460 |      20 |  1.84 |                                                                                                                                                |
| Wolf Brand: chili, no beans (1 can)                                |      800 |      38 |  2.19 |                                                                                                                                                |
| Jimmy Dean: Bacon Breakfast Bowl                                   |      410 |      28 |  2.49 |                                                                                                                                                |
| Arby's: Apple Crisp                                                |      570 |       6 |  2.49 |                                                                                                                                                |
| Tai Pei: Sweet & Sour Chicken (1 container, 397g)                  |      460 |      13 |  2.50 | Blech.  Hardly any chicken.  Not doing this again.                                                                                             |
| Tai Pei: Pepper Beef (1 package, 403g)                             |      490 |      19 |  2.50 |                                                                                                                                                |
| Marie Callender's: Turkey Pot Pie (1 pie, 16 oz)                   |     1090 |      22 |   2.5 |                                                                                                                                                |
| Wendy's: Blueberry Pineapple Fruitea (medium)                      |      300 |       0 |  2.69 |                                                                                                                                                |
| Chick-Fil-A: Chicken Soup (small)                                  |      140 |      12 |  2.69 |                                                                                                                                                |
| Stouffer's: Chicken Fettucini Alfredo                              |      540 |      22 |  2.79 |                                                                                                                                                |
| Chick-Fil-A: Greek yogurt parfait w/chocolate cookie crumbs        |      210 |      11 |  2.95 |                                                                                                                                                |
| Chick-Fil-A: Nuggets (8 ct.)                                       |      270 |      28 |  3.09 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken Sandwich                                |      490 |      30 |  3.35 |                                                                                                                                                |
| Chick-Fil-A: Chick-n-Strips (3 count)                              |      360 |      33 |  3.39 |                                                                                                                                                |
| Kroger: Fresh Foods Market: loaded baked potato style soup (15 oz) |      640 |      18 |  3.59 |                                                                                                                                                |
| Chick-Fil-A: Chicken Tortilla Soup                                 |      260 |      22 |  3.65 | Protein needs confirmation, it's not on their site.                                                                                            |
| Chick-Fil-A: Chicken, Egg, and Cheese Biscuit                      |      560 |      28 |  3.79 |                                                                                                                                                |
| Chick-Fil-A: Chicken, Egg & Cheese Bagel (1 sandwich)              |      480 |      27 |  3.79 |                                                                                                                                                |
| Arby's: Roast Beef Mid sandwich                                    |      460 |      33 |  4.29 |                                                                                                                                                |
| Chick-Fil-A: Chick-n-Strips (4 count)                              |      470 |      43 |  4.39 |                                                                                                                                                |
| KFC: Chicken Pot Pie                                               |      790 |      29 |  5.20 | Price included cookie and drink, plus 0.20 for large size drink.  Was up all night, ate this at like 5am.                                      |
| Hardee's: Pork Chop'n'Gravy Biscuit                                |      590 |      28 |  5.46 | Combo with small drink, small hash browns                                                                                                      |
| KFC: Nashville Hot Chicken (3 tenders)                             |      530 |      34 |  5.49 | Nutrition info from a non-KFC site; price includes sides                                                                                       |
| Taco Bell: Quesarito, beef, (- sour cream, nacho cheese)           |      590 |      21 |  5.95 |                                                                                                                                                |
| Taco Bell: DoubleDilla, steak, chips & salsa                       |      920 |      41 |  5.95 | They ran it up COMPLETELY wrong, so I've no idea how much it would actually cost.                                                              |
| Arby's: Angus Three Cheese & Bacon sandwich                        |      670 |      47 |  6.00 | Meal was actually free since they got yesterday's wrong.                                                                                       |
| Taco Bell: Steakhouse Burrito, steak (1/2 burrito)                 |      400 |    19.5 |  6.19 | Ate half, counted full price                                                                                                                   |
| Taco Bell: Steakhouse Queso Nachos, steak (see comments)           |      880 |      27 |  6.19 | No sour cream, no beans, nacho cheese sauce instead of whatever it was supposed to have (they appear to have not made it right, big surprise). |
| Zaxby's: Chicken Fingers (3) (Big Zax Snak Meal)                   |      230 |      26 |  6.59 | Price of Snak Meal                                                                                                                             |
| Arby's: Three Cheese Steak sandwich w/bacon (1/2 of it)            |      368 |      24 |  6.60 | Counting full price of it.                                                                                                                     |
| Arby's: Three Cheese Steak sandwich w/bacon                        |      736 |      48 |  6.60 |                                                                                                                                                |
| Arby's: French Dip & Swiss sandwich                                |      540 |      35 |  6.74 |                                                                                                                                                |
| Chick-Fil-A: Grilled Market Salad                                  |      320 |      26 |  7.19 |                                                                                                                                                |
| Wendy's: Baconator (no ketchup)                                    |      940 |      59 |  8.59 |                                                                                                                                                |
| Hardee's: Bacon 3-Way, 1/2 lb. (w/o cheese, lettuce, tomato)       |     1020 |      57 | 10.28 | 3 am election celebration (didn't give me receipt)                                                                                             |

*** By calories

#+BEGIN_SRC elisp
  (org-fitness-list-food-by "calories")
#+END_SRC

#+RESULTS:
| Food                                                                 | Calories | Protein | Price | Comment                                                                                                                                        |
| Captain D's: broccoli                                                |       20 |       2 |  0.00 |                                                                                                                                                |
| blueberries (1/4 cup)                                                |    21.25 |    0.28 |  0.00 | Check price                                                                                                                                    |
| Kroger: honey (1/2 tbsp)                                             |       30 |       0 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Smokehouse Barbecue Sauce (1 packet)                    |       35 |       0 |  0.00 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (1 tbsp)              |       35 |     2.5 |  0.22 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, pumpkin spice (1 tbsp)             |       40 |     0.5 |  0.21 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, strawberry (1 tbsp)                |       40 |     0.5 |  0.21 |                                                                                                                                                |
| Kroger: apricot preserves (1 tbsp)                                   |       40 |       0 |  0.00 | Check price                                                                                                                                    |
| Chick-Fil-A: Fruit Cup (medium)                                      |       45 |       0 |  2.75 |                                                                                                                                                |
| Chick-Fil-A: Fruit Cup (small)                                       |       45 |    2.09 |  2.09 |                                                                                                                                                |
| Kroger: spreadable butter w/canola oil (0.5 tbsp)                    |       50 |       0 |  0.00 |                                                                                                                                                |
| Smucker's: Blackberry Jam (1 tbsp)                                   |       50 |       0 |  0.00 | Check price                                                                                                                                    |
| Kroger: chopped chicken (32g)                                        |       55 |       8 |  0.00 | Check price                                                                                                                                    |
| Sargento: 4-cheddar shredded cheese blend (14g)                      |       55 |     3.5 |  0.00 | Check price                                                                                                                                    |
| Chick-Fil-A: Harvest Nut Granola (1 packet)                          |       60 |       1 |  0.00 |                                                                                                                                                |
| Kroger: canned pulled pork (56g)                                     |       60 |      12 |  0.76 |                                                                                                                                                |
| Kroger: Roast Beef, deli sliced (2 oz)                               |       60 |      11 |  0.48 |                                                                                                                                                |
| Kroger: turkey breast, honey smoked, deli thin sliced (2 oz)         |       60 |       9 |  0.66 |                                                                                                                                                |
| Kroger: turkey breast, mesquite smoked, deli thin sliced             |       60 |       9 |  0.66 |                                                                                                                                                |
| Ocean Spray: Craisins, blueberry-infused (1/8 cup)                   |       65 |       0 |       |                                                                                                                                                |
| Chick-Fil-A: Roasted Nut Blend (1 packet)                            |       70 |       1 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Seasoned Tortilla Strips                                |       70 |       1 |  0.00 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (2 tbsp)              |       70 |       5 |  0.43 |                                                                                                                                                |
| Kroger: cheddar cheese (1 slice)                                     |       80 |       5 |  0.20 |                                                                                                                                                |
| Kroger: Monterey Jack cheese (1 slice)                               |       80 |       5 |  0.20 |                                                                                                                                                |
| Kroger: Colby cheese (1 slice)                                       |       80 |       5 |  0.20 |                                                                                                                                                |
| Kroger: swiss cheese (1 slice)                                       |       80 |       6 |  0.31 |                                                                                                                                                |
| Pepperidge Farm: Swirl cinnamon raisin bread (1 slice)               |       80 |       3 |  0.19 |                                                                                                                                                |
| Dickey's: green beans w/bacon (4 oz. side)                           |       84 |       3 |  2.25 |                                                                                                                                                |
| Kroger: creamy peanut butter (1 tbsp/16 g)                           |       90 |     3.5 |  0.06 |                                                                                                                                                |
| Arby's: Sweet Tea (small)                                            |      100 |       0 |  0.00 | Best guess; sweet tea not listed on Arby's site                                                                                                |
| Pepperidge Farm: Swirl caramel apple bread (1 slice)                 |      100 |       3 |  0.29 |                                                                                                                                                |
| homemade gingerbread cookie                                          |      100 |       1 |  0.00 | Dr. Oden brought cookies to share today                                                                                                        |
| Banana (medium)                                                      |      105 |       1 |  0.22 |                                                                                                                                                |
| Kroger: canned pulled pork (1/2 of 10 oz. can)                       |      105 |      21 |  1.33 |                                                                                                                                                |
| Honeycrisp apple (208g)                                              |      108 |     0.5 |  0.00 | Check price                                                                                                                                    |
| Nature's Own: whole wheat hot dog bun                                |      110 |       5 |  0.40 |                                                                                                                                                |
| Thomas: 100% Whole Wheat Bagel Thins (1 bagel thin)                  |      110 |       6 |  0.00 | Free from Ms. Dodie (someone gave them to her)                                                                                                 |
| Chicken-of-the-Sea: Canned Salmon (1 5-oz can)                       |      120 |      26 |  1.00 |                                                                                                                                                |
| Arby's: Dr. Pepper (small)                                           |      130 |       0 |  1.59 |                                                                                                                                                |
| Met-Rx: 100% Natural Whey Chocolate (1 scoop)                        |      130 |      23 |  0.93 |                                                                                                                                                |
| Nature's Own: whole wheat hamburger bun                              |      130 |       6 |  0.40 |                                                                                                                                                |
| Ocean Spray: Craisins (1/4 cup)                                      |      130 |       0 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Chicken Soup (small)                                    |      140 |      12 |  2.69 |                                                                                                                                                |
| Mission: soft taco tortilla                                          |      140 |       4 |  0.00 | Check price                                                                                                                                    |
| Nature's Own: honey wheat bread (2 slices)                           |      140 |       6 |  0.32 |                                                                                                                                                |
| Ballpark: Angus Beef Frank (original)                                |      150 |       6 |  0.62 |                                                                                                                                                |
| Dr. Pepper: from 2-liter bottle (12 oz/355 ml)                       |      150 |       0 |  0.00 | Check price                                                                                                                                    |
| Wal-Mart/Marketside: chicken salad w/cranberries, pecans (1/4 cup)   |      150 |       5 |  0.00 | Check price                                                                                                                                    |
| Quaker: Old Fashioned Oatmeal (1/2 cup)                              |      150 |       5 |  0.00 |                                                                                                                                                |
| Oroweat: sesame-seeded sandwich roll                                 |      150 |       5 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| Hardee's: Dr. Pepper (small)                                         |      150 |       0 |  0.00 | Price included in combo                                                                                                                        |
| Zaxby's: Texas Toast (1 piece)                                       |      150 |       3 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Zaxby's: Dr. Pepper (small, 22 oz)                                   |      150 |       0 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Nature Valley: Dark Chocolate, Peanut & Almond granola bar           |      160 |       3 |  0.50 |                                                                                                                                                |
| Thomas: English muffin, blueberry                                    |      160 |       5 |  0.61 |                                                                                                                                                |
| Quaker: Instant Oatmeal, apple cinnamon (1 packet)                   |      160 |       4 |  0.00 |                                                                                                                                                |
| Quaker: Steel Cut oatmeal w/blueberries, cranberries (1 packet)      |      170 |       4 |  0.34 |                                                                                                                                                |
| Kellogg's: Special K Protein Meal Bar, Chocolately Chip              |      170 |      12 |  1.00 |                                                                                                                                                |
| Chick-Fil-A: Sweet Tea (large)                                       |      170 |       0 |  0.00 |                                                                                                                                                |
| KFC: Chocolate Chip Cookie                                           |      170 |       2 |  0.00 |                                                                                                                                                |
| KFC: Coleslaw (1 serving)                                            |      170 |       0 |  0.00 |                                                                                                                                                |
| Sara Lee: Sweet Hawaiian Sandwich Roll (1 bun)                       |      170 |       5 |  0.34 |                                                                                                                                                |
| Taco Bell: Cruncy Taco (beef, cheese, lettuce)                       |      170 |       8 |  0.00 | Price included in combo                                                                                                                        |
| Chick-Fil-A: Dr. Pepper (medium)                                     |      180 |       0 |  1.59 |                                                                                                                                                |
| McCormick: Grill Mates, Montreal Steak smoked sausage (1 link)       |      180 |       9 |  0.37 |                                                                                                                                                |
| Glutenfreeda: Apple Cinnamon with Flax instant oatmeal               |      180 |       6 |  0.00 | Check price                                                                                                                                    |
| Glutenfreeda: Banana Maple with Flax instant oatmeal                 |      180 |       6 |  0.00 | Check price                                                                                                                                    |
| KFC: biscuit                                                         |      180 |       4 |  0.00 |                                                                                                                                                |
| Kroger: creamy peanut butter (2 tbsp/32 g)                           |      180 |       7 |  0.12 |                                                                                                                                                |
| Nature Valley: Protein Chewy Bar, peanut butter dark chocolate       |      190 |      10 |  0.70 |                                                                                                                                                |
| McCormick: Grill Mates, Chipotle & Cheddar smoked sausage (1 link)   |      190 |       8 |  0.37 |                                                                                                                                                |
| Wendy's: Dr. Pepper (medium)                                         |      190 |       0 |  0.00 |                                                                                                                                                |
| Kellogg's: Special K Nourish Apple Raspberry Almond cereal (1 cup)   |      190 |       5 |  0.64 |                                                                                                                                                |
| Chick-Fil-A: Zesty Apple Cider Vinaigrette Dressing (1 packet)       |      200 |       0 |  0.00 |                                                                                                                                                |
| Arby's: Mt. Dew (small)                                              |      200 |       0 |  0.00 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, 67g)                     |      200 |      12 |     0 | Check price                                                                                                                                    |
| Wendy's: Coca-Cola (small)                                           |      200 |       0 |  0.00 | Price included in Baconator meal                                                                                                               |
| homemade: hamburger patty (100g, guessing)                           |      204 |      15 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| Captain D's: baked potato (addon to dinner)                          |      210 |       6 |  0.39 |                                                                                                                                                |
| Chick-Fil-A: Greek yogurt parfait w/chocolate cookie crumbs          |      210 |      11 |  2.95 |                                                                                                                                                |
| Zaxby's: Chicken Fingers (3) (Big Zax Snak Meal)                     |      230 |      26 |  6.59 | Price of Snak Meal                                                                                                                             |
| Chick-Fil-A: Hash Rounds (1 box)                                     |      240 |       2 |  1.19 |                                                                                                                                                |
| KFC: BBQ Baked Beans (1 serving)                                     |      240 |      14 |  0.00 |                                                                                                                                                |
| Campbell's Chunky: Savory Pot Roast                                  |      240 |      12 |  1.79 |                                                                                                                                                |
| Wendy's: Dr. Pepper (large)                                          |      240 |       0 |  0.55 | $0.55 on top of Baconator combo                                                                                                                |
| Quaker: Protein Oatmeal, Cranberry Almond (1 packet)                 |      240 |      10 |  0.50 |                                                                                                                                                |
| Sonic: Tater Tots (small)                                            |      250 |       2 |  0.00 |                                                                                                                                                |
| KFC: Dr. Pepper (medium, 20 oz)                                      |      250 |       0 |  1.99 |                                                                                                                                                |
| Taco Bell: Chips and Salsa                                           |      250 |       4 |  1.29 |                                                                                                                                                |
| Arby's: Dr. Pepper (medium)                                          |      252 |       0 |  1.50 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, ~102g)                   |      258 |      15 |  1.15 |                                                                                                                                                |
| Chick-Fil-A: Dr. Pepper (large)                                      |      260 |       0 |  1.89 |                                                                                                                                                |
| Chick-Fil-A: Chicken Tortilla Soup                                   |      260 |      22 |  3.65 |                                                                                                                                                |
| Campbell's Chunky: Clam Chowder (1 can)                              |      260 |      10 |  1.79 |                                                                                                                                                |
| Jimmy Dean: Turkey Sausage & Bacon frittatas (2)                     |      260 |      13 |  1.96 |                                                                                                                                                |
| Hardee's: Hash Rounds (small)                                        |      260 |       2 |  0.00 | Price included in combo                                                                                                                        |
| Hardee's: Cherry Coke (medium)                                       |      260 |       0 |  0.00 |                                                                                                                                                |
| Kroger: bagel, cinnamon raisin (1 bagel)                             |      260 |       8 |  0.33 |                                                                                                                                                |
| Chick-Fil-A: Nuggets (8 ct.)                                         |      270 |      28 |  3.09 |                                                                                                                                                |
| Thomas: blueberry bagel                                              |      270 |       9 |  0.67 |                                                                                                                                                |
| KFC: Potato Wedges (individual size)                                 |      270 |       4 |  0.00 |                                                                                                                                                |
| Thomas: "Everything" bagel                                           |      280 |       9 |  0.58 |                                                                                                                                                |
| Pizza Hut: Hershey's Hot Chocolate Brownie (1 square, 1/9th pan)     |      290 |       3 |  0.78 |                                                                                                                                                |
| Jimmy Dean: Steak & Eggs Breakfast Bowl                              |      290 |      15 |  2.49 |                                                                                                                                                |
| Chick-Fil-A: Peppermint Chocolate Chip milkshake (1/2 of small)      |      295 |       6 |  1.43 |                                                                                                                                                |
| Chick-Fil-A: Bacon, Egg, and Cheese English Muffin                   |      300 |      16 |  2.79 |                                                                                                                                                |
| Wendy's: Blueberry Pineapple Fruitea (medium)                        |      300 |       0 |  2.69 |                                                                                                                                                |
| Papa John's: Pan pizza, 2x pepperoni, extra pan sauce (1 slice)      |      305 |      11 |  0.00 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, ~125g)                   |      308 |    37.5 |  1.66 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, ~107g)                   |      319 |      19 |  1.43 |                                                                                                                                                |
| Chick-Fil-A: Grilled Market Salad                                    |      320 |      26 |  7.25 |                                                                                                                                                |
| Wendy's: Fries (small)                                               |      320 |       5 |  0.00 |                                                                                                                                                |
| KFC: Chicken Little, Nashville Hot                                   |      320 |      13 |  1.59 | Don't know if Nashville Hot makes a difference                                                                                                 |
| Arby's: Dr. Pepper (large)                                           |      324 |       0 |  1.80 |                                                                                                                                                |
| Sonic: Dr. Pepper w/cranberry, vanilla (large)                       |      325 |       0 |  1.42 |                                                                                                                                                |
| Papa John's: Bacon Cheddarburger pan pizza, 1 slice                  |      330 |      12 |  0.00 | Pizza was free because they messed up                                                                                                          |
| Zaxby's: Honey Mustard (1 portion cup)                               |      330 |       1 |  0.00 |                                                                                                                                                |
| Dickey's: waffle fries (4 oz. side)                                  |      338 |       4 |  2.25 |                                                                                                                                                |
| Arby's: Mozzarella Sticks (3 piece)                                  |      345 |      15 |  1.38 | He gave me a 7-piece by mistake, so I ate 4 and now the rest.                                                                                  |
| Chick-Fil-A: Chick-n-Minis (4 count)                                 |      350 |      19 |  3.09 |                                                                                                                                                |
| Chick-Fil-A: Grilled Chicken Cool Wrap                               |      350 |      37 |  5.25 |                                                                                                                                                |
| Chick-Fil-A: Chocolate Chip Cookie                                   |      350 |       4 |  1.19 |                                                                                                                                                |
| Pizza Hut: Lrg Stuffed Crust, 2x pepperoni, pretzel crust (1 slice)  |      360 |      15 |  2.15 |                                                                                                                                                |
| Pizza Hut: Meaty Marinara Bake w/garlic bread (individual, 1/2)      |      360 |    16.5 |  0.00 |                                                                                                                                                |
| Sonic: Sweet Tea (Rt. 44)                                            |      360 |       0 |  0.00 | Free w/coupon                                                                                                                                  |
| Zaxby's: Brownie                                                     |      360 |       4 |  0.99 |                                                                                                                                                |
| Chick-Fil-A: Chick-n-Strips (3 count)                                |      360 |      33 |  3.39 |                                                                                                                                                |
| Campbell's Chunky: Chipotle Chicken & Corn Chowder (1 can, 240ml)    |      360 |      14 |  1.79 |                                                                                                                                                |
| Hardee's: Natural-Cut French Fries (small)                           |      360 |       4 |       |                                                                                                                                                |
| Arby's: Three Cheese Steak sandwich w/bacon (1/2 of it)              |      368 |      24 |  6.60 | Counting full price of it.                                                                                                                     |
| Captain D's: Dr. Pepper (medium)                                     |      370 |       0 |  2.09 |                                                                                                                                                |
| Banquet: Backyard BBQ meal                                           |      370 |      15 |  1.29 |                                                                                                                                                |
| Hardee's: Country Ham Biscuit                                        |      370 |      15 |  0.00 |                                                                                                                                                |
| Maruchan: Ramen noodles, beef (1 package with flavor packet)         |      380 |      10 |  0.21 |                                                                                                                                                |
| Campbell's: Slow Kettle Style Soup, SW-Style Chicken Chili (15.7 oz) |      380 |      26 |  2.98 | From Amazon                                                                                                                                    |
| Campbell's Chunky Soup: Chicken, Broccoli, Cheese w/potato (1 can)   |      380 |      14 |  1.79 |                                                                                                                                                |
| Taco Bell: Dr. Pepper (large)                                        |      380 |       0 |  1.00 |                                                                                                                                                |
| Campbell's Chunky: Chicken Corn Chowder (1 can, 240ml)               |      380 |      10 |  1.79 |                                                                                                                                                |
| KFC: Dr. Pepper (large, 30 oz)                                       |      380 |       0 |  0.00 | Included in "Fill-Up Box"                                                                                                                      |
| Captain D's: grilled salmon dinner (w/rice)                          |      390 |      34 |  7.59 |                                                                                                                                                |
| Chick-Fil-A: Waffle Potato Fries (large)                             |      400 |       5 |  1.89 | Check price                                                                                                                                    |
| Chick-Fil-A: Waffle Potato Fries (medium)                            |      400 |       5 |  1.69 |                                                                                                                                                |
| Taco Bell: Steakhouse Burrito, steak (1/2 burrito)                   |      400 |    19.5 |  6.19 | Ate half, counted full price                                                                                                                   |
| Campbell's Chunky: Chili Mac (1 can)                                 |      400 |      18 |  1.79 |                                                                                                                                                |
| Jimmy Dean: Bacon Breakfast Bowl                                     |      410 |      28 |  2.49 |                                                                                                                                                |
| Taco Bell: Extra-Large Sangrita Blast Mt. Dew                        |      410 |       0 |  0.00 | Price included in combo.  Not sure about size, doesn't seem to match web site.                                                                 |
| Campbell's Chunky Soup: Spicy BBQ Seasoned Chicken w/Beans (1 can)   |      420 |      22 |  1.79 |                                                                                                                                                |
| Arby's: Salted Caramel & Chocolate Cookie                            |      430 |       4 |  1.00 |                                                                                                                                                |
| Arby's: Mozzarella Sticks (4 piece)                                  |      440 |      19 |  1.30 |                                                                                                                                                |
| Chick-Fil-A: Classic Chicken Sandwich                                |      440 |      28 |  3.09 |                                                                                                                                                |
| Zaxby's: Crinkle Fries (5 oz)                                        |      440 |       5 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Chick-Fil-A: Spicy Chicken Biscuit                                   |      440 |      16 |       | Free one from last time, but they also left off the egg and cheese this time.                                                                  |
| Arby's: Triple Chocolate Cookie                                      |      450 |       5 |  1.00 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken Breakfast Burrito                         |      450 |      30 |  3.90 |                                                                                                                                                |
| Taco Bell: Beefy Fritos Burrito (-nacho cheese, w/3 cheese blend)    |      450 |      16 |  1.39 |                                                                                                                                                |
| Arby's: Roast Beef Mid sandwich                                      |      460 |      33 |  4.29 |                                                                                                                                                |
| Tai Pei: Sweet & Sour Chicken (1 container, 397g)                    |      460 |      13 |  2.50 | Blech.  Hardly any chicken.  Not doing this again.                                                                                             |
| Chick-Fil-A: Chick-n-Strips (4 count)                                |      470 |      43 |  4.39 |                                                                                                                                                |
| Campbell's Chunky: Chili, Hot & Spicy with Bean Firehouse (1 can)    |      480 |      28 |  1.79 |                                                                                                                                                |
| Chick-Fil-A: Chicken, Egg & Cheese Bagel (1 sandwich)                |      480 |      27 |  3.79 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken Sandwich                                  |      490 |      30 |  3.35 |                                                                                                                                                |
| Tai Pei: Pepper Beef (1 package, 403g)                               |      490 |      19 |  2.50 |                                                                                                                                                |
| Chick-Fil-A: Chicken Salad Sandwich                                  |      500 |      27 |  4.09 |                                                                                                                                                |
| Sonic: Chili Cheese Coney (regular)                                  |      500 |      20 |  0.00 |                                                                                                                                                |
| Arby's: Double Roast Beef sandwich                                   |      510 |      38 |  4.69 |                                                                                                                                                |
| KFC: Nashville Hot Chicken (3 tenders)                               |      530 |      34 |  5.49 | KFC food was free because...they were a bit dysfunctional tonight                                                                              |
| Stouffer's: Chicken Fettucini Alfredo                                |      540 |      22 |  2.79 |                                                                                                                                                |
| Arby's: French Dip & Swiss sandwich                                  |      540 |      35 |  6.74 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken, Egg, and Cheese Biscuit                  |      560 |      28 |  3.19 |                                                                                                                                                |
| Chick-Fil-A: Chicken, Egg, and Cheese Biscuit                        |      560 |      28 |  3.98 |                                                                                                                                                |
| Banquet: Mega Meal, boneless rib-shaped patties w/mashed potatoes    |      570 |      28 |  1.99 |                                                                                                                                                |
| Arby's: Apple Crisp                                                  |      570 |       6 |  2.49 |                                                                                                                                                |
| Sonic: Custard Concrete, Dark Chocolate & Oreo (2/3 of small)        |      590 |       9 |  5.47 | Small has 880 cal, 14g protein                                                                                                                 |
| Hardee's: Pork Chop'n'Gravy Biscuit                                  |      590 |      28 |  5.46 | Combo with small drink, small hash browns                                                                                                      |
| Taco Bell: Quesarito, beef, (- sour cream, nacho cheese)             |      590 |      21 |  5.95 |                                                                                                                                                |
| Arby's: Half-Pound Roast Beef sandwich                               |      610 |      48 |  5.69 |                                                                                                                                                |
| Banquet: Mega Meal, salisbury steak                                  |      640 |      28 |  1.99 |                                                                                                                                                |
| Kroger: Fresh Foods Market: loaded baked potato style soup (15 oz)   |      640 |      18 |  3.59 |                                                                                                                                                |
| Arby's: Three-Cheese Steak sandwich                                  |      650 |      42 |  7.89 | As small combo with mozzarella sticks                                                                                                          |
| Arby's: Angus Three Cheese & Bacon sandwich                          |      670 |      47 |  6.00 | Meal was actually free since they got yesterday's wrong.                                                                                       |
| Arby's: Three Cheese Steak sandwich w/bacon                          |      736 |      48 |  6.60 |                                                                                                                                                |
| KFC: Chicken Pot Pie                                                 |      790 |      29 |  4.99 |                                                                                                                                                |
| Wolf Brand: chili, no beans (1 can)                                  |      800 |      38 |  2.19 |                                                                                                                                                |
| Dickey's: Westerner w/chopped brisket, pulled pork (1 sandwich)      |      868 |    43.5 |  8.50 |                                                                                                                                                |
| Taco Bell: Steakhouse Queso Nachos, steak (see comments)             |      880 |      27 |  6.19 | No sour cream, no beans, nacho cheese sauce instead of whatever it was supposed to have (they appear to have not made it right, big surprise). |
| Taco Bell: DoubleDilla, steak, chips & salsa                         |      920 |      41 |  5.95 | They ran it up COMPLETELY wrong, so I've no idea how much it would actually cost.                                                              |
| Wendy's: Baconator (no ketchup)                                      |      940 |      59 |  8.59 |                                                                                                                                                |
| Hardee's: Bacon 3-Way, 1/2 lb. (w/o cheese, lettuce, tomato)         |     1020 |      57 | 10.28 | 3 am election celebration (didn't give me receipt)                                                                                             |
| Marie Callender's: Turkey Pot Pie (1 pie, 16 oz)                     |     1090 |      22 |   2.5 |                                                                                                                                                |

*** By calories/protein
    :PROPERTIES:
    :ID:       43bcbff8-bf10-40f6-ae05-5f490d986094
    :END:

#+BEGIN_SRC elisp :exports results
  (org-fitness-list-food-by-calories-per-protein)
#+END_SRC

#+RESULTS:
| Food                                                               | Calories/Protein | Calories | Protein | Price | Comment                                                                                                                                        |
| Chicken-of-the-Sea: Canned Salmon (1 5-oz can)                     |                4 |      120 |      26 |  1.00 |                                                                                                                                                |
| Met-Rx: 100% Natural Whey Chocolate (1 scoop)                      |                5 |      130 |      23 |  0.93 |                                                                                                                                                |
| Kroger: canned pulled pork (56g)                                   |                5 |       60 |      12 |  0.76 |                                                                                                                                                |
| Kroger: canned pulled pork (1/2 of 10 oz. can)                     |                5 |      105 |      21 |  1.33 |                                                                                                                                                |
| Kroger: Roast Beef, deli sliced (2 oz)                             |                5 |       60 |      11 |  0.48 |                                                                                                                                                |
| Kroger: turkey breast, honey smoked, deli thin sliced (2 oz)       |                6 |       60 |       9 |  0.66 |                                                                                                                                                |
| Kroger: turkey breast, mesquite smoked, deli thin sliced           |                6 |       60 |       9 |  0.66 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, ~125g)                 |                8 |      308 |    37.5 |  1.66 |                                                                                                                                                |
| Zaxby's: Chicken Fingers (3) (Big Zax Snak Meal)                   |                8 |      230 |      26 |  6.59 | Price of Snak Meal                                                                                                                             |
| Chick-Fil-A: Nuggets (8 ct.)                                       |                9 |      270 |      28 |  3.09 |                                                                                                                                                |
| Chick-Fil-A: Chick-n-Strips (3 count)                              |               10 |      360 |      33 |  3.39 |                                                                                                                                                |
| Chick-Fil-A: Chick-n-Strips (4 count)                              |               10 |      470 |      43 |  4.39 |                                                                                                                                                |
| Chick-Fil-A: Chicken Soup (small)                                  |               11 |      140 |      12 |  2.69 |                                                                                                                                                |
| Chick-Fil-A: Chicken Tortilla Soup                                 |               11 |      260 |      22 |  3.65 |                                                                                                                                                |
| Chick-Fil-A: Grilled Market Salad                                  |               12 |      320 |      26 |  7.19 |                                                                                                                                                |
| Kroger: swiss cheese (1 slice)                                     |               13 |       80 |       6 |  0.31 |                                                                                                                                                |
| homemade: hamburger patty (100g, guessing)                         |               13 |      204 |      15 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| Arby's: Roast Beef Mid sandwich                                    |               13 |      460 |      33 |  4.29 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (1 tbsp)            |               14 |       35 |     2.5 |  0.22 |                                                                                                                                                |
| Jimmy Dean: Bacon Breakfast Bowl                                   |               14 |      410 |      28 |  2.49 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, black cherry (2 tbsp)            |               14 |       70 |       5 |  0.43 |                                                                                                                                                |
| Arby's: Angus Three Cheese & Bacon sandwich                        |               14 |      670 |      47 |  6.00 | Meal was actually free since they got yesterday's wrong.                                                                                       |
| Wendy's: Baconator (no ketchup)                                    |               15 |      940 |      59 |  8.59 |                                                                                                                                                |
| Arby's: Three Cheese Steak sandwich w/bacon (1/2 of it)            |               15 |      368 |      24 |  6.60 | Counting full price of it.                                                                                                                     |
| KFC: Nashville Hot Chicken (3 tenders)                             |               15 |      530 |      34 |  5.49 | Nutrition info from a non-KFC site; price includes sides                                                                                       |
| Arby's: Three Cheese Steak sandwich w/bacon                        |               15 |      736 |      48 |  6.60 |                                                                                                                                                |
| Chick-Fil-A: Classic Chicken Sandwich                              |               15 |      440 |      28 |  3.09 |                                                                                                                                                |
| Arby's: French Dip & Swiss sandwich                                |               15 |      540 |      35 |  6.74 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, ~102g)                 |               16 |      304 |      18 |  1.35 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken Sandwich                                |               16 |      490 |      30 |  3.35 |                                                                                                                                                |
| Kroger: cheddar cheese (1 slice)                                   |               16 |       80 |       5 |  0.20 | From 4-type multi pack, cheaper than cheddar-only package                                                                                      |
| Kroger: Monterey Jack cheese (1 slice)                             |               16 |       80 |       5 |  0.20 |                                                                                                                                                |
| Kroger: deli fried chicken tender (1 piece, 67g)                   |               16 |      200 |      12 |     0 | Check price                                                                                                                                    |
| Kroger: deli fried chicken tender (1 piece, ~107g)                 |               16 |      319 |      19 |  1.43 |                                                                                                                                                |
| Kroger: Colby cheese (1 slice)                                     |               16 |       80 |       5 |  0.20 |                                                                                                                                                |
| Hardee's: Bacon 3-Way, 1/2 lb. (w/o cheese, lettuce, tomato)       |               17 |     1020 |      57 | 10.28 | 3 am election celebration (didn't give me receipt)                                                                                             |
| Campbell's Chunky: Chili, Hot & Spicy with Bean Firehouse (1 can)  |               17 |      480 |      28 |  1.79 |                                                                                                                                                |
| Chick-Fil-A: Chicken, Egg & Cheese Bagel (1 sandwich)              |               17 |      480 |      27 |  3.79 |                                                                                                                                                |
| Thomas: 100% Whole Wheat Bagel Thins (1 bagel thin)                |               18 |      110 |       6 |  0.00 | Free from Ms. Dodie (someone gave them to her)                                                                                                 |
| Campbell's Chunky Soup: Spicy BBQ Seasoned Chicken w/Beans (1 can) |               19 |      420 |      22 |  1.79 |                                                                                                                                                |
| Chick-Fil-A: Greek yogurt parfait w/chocolate cookie crumbs        |               19 |      210 |      11 |  2.95 |                                                                                                                                                |
| McCormick: Grill Mates, Montreal Steak smoked sausage (1 link)     |               20 |      180 |       9 |  0.37 |                                                                                                                                                |
| Jimmy Dean: Turkey Sausage & Bacon frittatas (2)                   |               20 |      260 |      13 |  1.96 |                                                                                                                                                |
| Chick-Fil-A: Spicy Chicken, Egg, and Cheese Biscuit                |               20 |      560 |      28 |  3.19 |                                                                                                                                                |
| Campbell's Chunky: Savory Pot Roast                                |               20 |      240 |      12 |  1.79 |                                                                                                                                                |
| Chick-Fil-A: Chicken, Egg, and Cheese Biscuit                      |               20 |      560 |      28 |  3.98 |                                                                                                                                                |
| Nature's Own: whole wheat hamburger bun                            |               21 |      130 |       6 |  0.40 |                                                                                                                                                |
| Taco Bell: Steakhouse Burrito, steak (1/2 burrito)                 |               21 |      400 |    19.5 |  6.19 | Ate half, counted full price                                                                                                                   |
| Hardee's: Pork Chop'n'Gravy Biscuit                                |               21 |      590 |      28 |  5.46 | Combo with small drink, small hash browns                                                                                                      |
| Taco Bell: Cruncy Taco (beef, cheese, lettuce)                     |               21 |      170 |       8 |  0.00 | Price included in combo                                                                                                                        |
| Wolf Brand: chili, no beans (1 can)                                |               21 |      800 |      38 |  2.19 |                                                                                                                                                |
| Nature's Own: whole wheat hot dog bun                              |               22 |      110 |       5 |  0.40 |                                                                                                                                                |
| Banquet: Mega Meal, salisbury steak                                |               22 |      640 |      28 |  1.99 |                                                                                                                                                |
| Taco Bell: DoubleDilla, steak, chips & salsa                       |               22 |      920 |      41 |  5.95 | They ran it up COMPLETELY wrong, so I've no idea how much it would actually cost.                                                              |
| Campbell's Chunky: Chili Mac (1 can)                               |               22 |      400 |      18 |  1.79 |                                                                                                                                                |
| Nature's Own: honey wheat bread (2 slices)                         |               23 |      140 |       6 |  0.32 |                                                                                                                                                |
| Arby's: Mozzarella Sticks (3 piece)                                |               23 |      345 |      15 |  1.38 | He gave me a 7-piece by mistake, so I ate 4 and now the rest.                                                                                  |
| Arby's: Mozzarella Sticks (4 piece)                                |               23 |      460 |      20 |  1.84 |                                                                                                                                                |
| Stouffer's: Chicken Fettucini Alfredo                              |               24 |      540 |      22 |  2.79 |                                                                                                                                                |
| Hardee's: Country Ham Biscuit                                      |               24 |      370 |      15 |  0.00 |                                                                                                                                                |
| Quaker: Protein Oatmeal, Cranberry Almond (1 packet)               |               24 |      240 |      10 |  0.50 |                                                                                                                                                |
| KFC: Chicken Little, Nashville Hot                                 |               24 |      320 |      13 |  1.59 | Don't know if Nashville Hot makes a difference                                                                                                 |
| Tai Pei: Pepper Beef (1 package, 403g)                             |               25 |      490 |      19 |  2.50 |                                                                                                                                                |
| Campbell's Chunky: Chipotle Chicken & Corn Chowder (1 can, 240ml)  |               25 |      360 |      14 |  1.79 |                                                                                                                                                |
| Kroger: creamy peanut butter (2 tbsp/32 g)                         |               25 |      180 |       7 |  0.12 |                                                                                                                                                |
| Kroger: creamy peanut butter (1 tbsp/16 g)                         |               26 |       90 |     3.5 |  0.06 |                                                                                                                                                |
| Pepperidge Farm: Swirl cinnamon raisin bread (1 slice)             |               26 |       80 |       3 |  0.19 |                                                                                                                                                |
| Campbell's Chunky Soup: Chicken, Broccoli, Cheese w/potato (1 can) |               27 |      380 |      14 |  1.79 |                                                                                                                                                |
| KFC: Chicken Pot Pie                                               |               27 |      790 |      29 |  5.20 | Price included cookie and drink, plus 0.20 for large size drink.  Was up all night, ate this at like 5am.                                      |
| Chick-Fil-A: Spicy Chicken Biscuit                                 |               27 |      440 |      16 |       | Free one from last time, but they also left off the egg and cheese this time.                                                                  |
| Taco Bell: Quesarito, beef, (- sour cream, nacho cheese)           |               28 |      590 |      21 |  5.95 |                                                                                                                                                |
| Taco Bell: Beefy Fritos Burrito (-nacho cheese, w/3 cheese blend)  |               28 |      450 |      16 |  1.39 |                                                                                                                                                |
| Wal-Mart/Marketside: chicken salad w/cranberries, pecans (1/4 cup) |               30 |      150 |       5 |  0.00 | Check price                                                                                                                                    |
| Thomas: blueberry bagel                                            |               30 |      270 |       9 |  0.67 |                                                                                                                                                |
| Quaker: Old Fashioned Oatmeal (1/2 cup)                            |               30 |      150 |       5 |  0.00 |                                                                                                                                                |
| Oroweat: sesame-seeded sandwich roll                               |               30 |      150 |       5 |  0.00 | from visiting Ms. Dodie                                                                                                                        |
| Glutenfreeda: Banana Maple with Flax instant oatmeal               |               30 |      180 |       6 |  0.00 | Check price                                                                                                                                    |
| Thomas: "Everything" bagel                                         |               31 |      280 |       9 |  0.58 |                                                                                                                                                |
| Taco Bell: Steakhouse Queso Nachos, steak (see comments)           |               32 |      880 |      27 |  6.19 | No sour cream, no beans, nacho cheese sauce instead of whatever it was supposed to have (they appear to have not made it right, big surprise). |
| Kroger: bagel, cinnamon raisin (1 bagel)                           |               32 |      260 |       8 |  0.33 |                                                                                                                                                |
| Pepperidge Farm: Swirl caramel apple bread (1 slice)               |               33 |      100 |       3 |  0.29 |                                                                                                                                                |
| Sara Lee: Sweet Hawaiian Sandwich Roll (1 bun)                     |               34 |      170 |       5 |  0.34 |                                                                                                                                                |
| Kroger: Fresh Foods Market: loaded baked potato style soup (15 oz) |               35 |      640 |      18 |  3.59 |                                                                                                                                                |
| Tai Pei: Sweet & Sour Chicken (1 container, 397g)                  |               35 |      460 |      13 |  2.50 | Blech.  Hardly any chicken.  Not doing this again.                                                                                             |
| Maruchan: Ramen noodles, beef (1 package with flavor packet)       |               38 |      380 |      10 |  0.21 |                                                                                                                                                |
| Campbell's Chunky: Chicken Corn Chowder (1 can, 240ml)             |               38 |      380 |      10 |  1.79 |                                                                                                                                                |
| Kellogg's: Special K Nourish Apple Raspberry Almond cereal (1 cup) |               38 |      190 |       5 |  0.64 |                                                                                                                                                |
| Quaker: Instant Oatmeal, apple cinnamon (1 packet)                 |               40 |      160 |       4 |  0.00 |                                                                                                                                                |
| Quaker: Steel Cut oatmeal w/blueberries, cranberries (1 packet)    |               42 |      170 |       4 |  0.34 | Price from Google search, Walmart listing                                                                                                      |
| KFC: biscuit                                                       |               45 |      180 |       4 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Peppermint Chocolate Chip milkshake (1/2 of small)    |               49 |      295 |       6 |  1.43 |                                                                                                                                                |
| Marie Callender's: Turkey Pot Pie (1 pie, 16 oz)                   |               49 |     1090 |      22 |   2.5 |                                                                                                                                                |
| Zaxby's: Texas Toast (1 piece)                                     |               50 |      150 |       3 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Chick-Fil-A: Harvest Nut Granola (1 packet)                        |               60 |       60 |       1 |  0.00 |                                                                                                                                                |
| Taco Bell: Chips and Salsa                                         |               62 |      250 |       4 |  1.29 |                                                                                                                                                |
| Wendy's: Fries (small)                                             |               64 |      320 |       5 |  0.00 |                                                                                                                                                |
| KFC: Potato Wedges (individual size)                               |               67 |      270 |       4 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Seasoned Tortilla Strips                              |               70 |       70 |       1 |  0.00 |                                                                                                                                                |
| Chick-Fil-A: Roasted Nut Blend (1 packet)                          |               70 |       70 |       1 |  0.00 |                                                                                                                                                |
| blueberries (1/4 cup)                                              |               76 |    21.25 |    0.28 |  0.00 | Check price                                                                                                                                    |
| Kraft: Philadelphia cream cheese, pumpkin spice (1 tbsp)           |               80 |       40 |     0.5 |  0.21 |                                                                                                                                                |
| Chick-Fil-A: Waffle Potato Fries (medium)                          |               80 |      400 |       5 |  1.69 |                                                                                                                                                |
| Kraft: Philadelphia cream cheese, strawberry (1 tbsp)              |               80 |       40 |     0.5 |  0.21 |                                                                                                                                                |
| Chick-Fil-A: Chocolate Chip Cookie                                 |               87 |      350 |       4 |  1.19 |                                                                                                                                                |
| Zaxby's: Crinkle Fries (5 oz)                                      |               88 |      440 |       5 |  0.00 | Price included in Snak Meal                                                                                                                    |
| Arby's: Triple Chocolate Cookie                                    |               90 |      450 |       5 |  1.00 |                                                                                                                                                |
| Zaxby's: Brownie                                                   |               90 |      360 |       4 |  0.99 |                                                                                                                                                |
| Hardee's: Natural-Cut French Fries (small)                         |               90 |      360 |       4 |       |                                                                                                                                                |
| Arby's: Apple Crisp                                                |               95 |      570 |       6 |  2.49 |                                                                                                                                                |
| homemade gingerbread cookie                                        |              100 |      100 |       1 |  0.00 | Dr. Oden brought cookies to share today                                                                                                        |
| Banana (medium)                                                    |              105 |      105 |       1 |  0.22 |                                                                                                                                                |
| Arby's: Salted Caramel & Chocolate Cookie                          |              107 |      430 |       4 |  1.00 |                                                                                                                                                |
| Chick-Fil-A: Hash Rounds (1 box)                                   |              120 |      240 |       2 |  1.19 |                                                                                                                                                |
| Hardee's: Hash Rounds (small)                                      |              130 |      260 |       2 |  0.00 | Price included in combo                                                                                                                        |
| Honeycrisp apple (208g)                                            |              216 |      108 |     0.5 |  0.00 | Check price                                                                                                                                    |
| Zaxby's: Honey Mustard (1 portion cup)                             |              330 |      330 |       1 |  0.00 |                                                                                                                                                |


